DataProcessors/АРМ_ЗаписьКВрачу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>АРМ_ЗаписьКВрачу</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/Врачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Врачи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/АРМ_ЗаписьКВрачу/Forms/ФормаЗаписиПоВрачу/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПациент) Тогда
		
		Отказ = Истина;
		Возврат;
	
	КонецЕсли; 
	
	ТекущийПациент = ПараметрыСеанса.ТекущийПациент;
	
	ЗаполнитьФормуПоВрачамПациента();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуПоВрачамПациента()

	Результат = Неопределено;
	
	Если НЕ ОперацииWS.ВыполнитьОперацию("ПолучитьВрачейПациента", 
			Новый Структура("snils, МассивВрачейВКлиенте", 
				ТекущийПациент.СНИЛС,
				Справочники.Врачи.МассивСуществующихВрачей()
			), Результат) Тогда
			
		Если Результат <> Неопределено Тогда
			СтрокаОписанияРезультата = Результат.ОписаниеОшибки;
		КонецЕсли; 
		
	КонецЕсли;
	
	Если Результат = Неопределено
		ИЛИ Результат.ЕстьОшибки Тогда
		
		ДоступностьЭлементов = Ложь;
		
	Иначе
		
		Если Результат.Свойство("Врачи") Тогда
			
			Для каждого СтрокаТаблицы Из Результат.Врачи Цикл
				
				СсылкаНового = Справочники.Врачи.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТаблицы.УИД));
				СправочникОбъект = Справочники.Врачи.СоздатьЭлемент();
				СправочникОбъект.УстановитьСсылкуНового(СсылкаНового);
				СправочникОбъект.Наименование = СтрокаТаблицы.Наименование;
				СправочникОбъект.Специализация = СтрокаТаблицы.Специализация;
				Если НЕ ПустаяСтрока(СтрокаТаблицы.ДанныеКартинки) Тогда
					СправочникОбъект.Фото = Новый ХранилищеЗначения(Base64Значение(СтрокаТаблицы.ДанныеКартинки));
				КонецЕсли; 
				СправочникОбъект.Записать();
			
			КонецЦикла; 
		
		КонецЕсли;
				
		Запрос = Новый Запрос(ТекстЗапросаВрачей());
		Выборка = Запрос.Выполнить().Выбрать();
		Сч = 1;
		
		//ТаблицаФото.Очистить();
		//
		//Выборка = Запрос.Выполнить().Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	
		//	СтрокаФото = ТаблицаФото.Добавить();
		//	СтрокаФото.Врач = Выборка.Ссылка;
		//	ВрачОбъект = Выборка.Ссылка.ПолучитьОбъект();
		//	СтрокаФото.АдресФото = ПоместитьВоВременноеХранилище(ВрачОбъект.Фото.Получить(), УникальныйИдентификатор);
		//	
		//КонецЦикла;
		//
		//НачальнаяСтрока = 1;
		//АдресФото1 = "";
		//АдресФото2 = "";
		//
		//ВывестиФотоНаСервере(НачальнаяСтрока);
		
			
		
		Для каждого Элемент Из Элементы.ГруппаФотоВрачей.ПодчиненныеЭлементы Цикл
		
			Элементы.Удалить(Элемент);	
		
		КонецЦикла; 
		ДобавляемыеРеквизиты = Новый Массив;
		МассивАдресовКартинок = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			
			Если СозданныеРеквизиты.НайтиПоЗначению("АдресФото" + Сч) = Неопределено Тогда
				ТипРеквизита = Новый ОписаниеТипов("Строка");
				
				РеквизитФормы = Новый РеквизитФормы(
				"АдресФото" + Строка(Сч),  //Имя реквизита формы
				ТипРеквизита,     //Тип
				"",               //Путь  (Пусто, "Объект", ИмяТЧ) 
				);
				
				ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
				
			КонецЕсли;
			
			Сч = Сч + 1;
			
		КонецЦикла; 
		
		Если ДобавляемыеРеквизиты.Количество() > 0 Тогда
			//Заставляем форму создать новые реквизиты
			ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		КонецЕсли; 
		
		Выборка.Сбросить(); 
		Сч = 1;
		Пока Выборка.Следующий() Цикл
			
			//Группа = Элементы.Добавить("ГруппаВрача" + Строка(Сч), Тип("ГруппаФормы"), Элементы.ГруппаФотоВрачей);
			//Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			
			ПолеФото = Элементы.Добавить(
				"Фото" + Строка(Сч),    //Имя элемента формы
				Тип("ПолеФормы"), //Тип, всегда ПолеФормы
				Элементы.ГруппаФотоВрачей
			);	      //Контейнер для поля ввода (Форма,Группа,Страница)
			
			ПолеФото.Заголовок = Строка(Выборка.Ссылка) + " (" + Выборка.Специализация + ")";
			ПолеФото.Вид = ВидПоляФормы.ПолеКартинки;
			ПолеФото.ПутьКДанным = "АдресФото" + Строка(Сч);
			//ПолеФото.Высота = 100;
			//ПолеФото.Ширина = 100;
			ПолеФото.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Низ;
			ПолеФото.РастягиватьПоГоризонтали = Истина;
			ПолеФото.МаксимальнаяШирина = 50;
			
			ПолеФото.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
			ПолеФото.Гиперссылка = Истина;
			
			ПолеФото.РазмерКартинки = РазмерКартинки.Пропорционально;
			
			ВрачОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ЭтаФорма["АдресФото" + Строка(Сч)] = ПоместитьВоВременноеХранилище(ВрачОбъект.Фото.Получить(), УникальныйИдентификатор);
			
			ПолеФото.УстановитьДействие(
				"Нажатие", 		    //Имя события
				"ФотоНажатие"); 	//Имя процедуры обработчика			
			
			Сч = Сч + 1;
			
		КонецЦикла;
		
	КонецЕсли; 

	

КонецПроцедуры // ЗаполнитьФормуПоВрачамПациента()

&НаСервере
Функция ВывестиФотоНаСервере(НачальнаяСтрока)

	Элементы._Фото1.Видимость = Ложь;
	Элементы._Фото2.Видимость = Ложь;
	
	Если ТаблицаФото.Количество() >= НачальнаяСтрока Тогда
		
		_АдресФото1 = ТаблицаФото[НачальнаяСтрока - 1].АдресФото;
		Элементы._Фото1.Заголовок = Строка(ТаблицаФото[НачальнаяСтрока - 1].Врач) + " (" + ТаблицаФото[НачальнаяСтрока - 1].Врач.Специализация + ")";
		Элементы._Фото1.Видимость = Истина;
	
	КонецЕсли; 
	
	Если ТаблицаФото.Количество() >= НачальнаяСтрока + 1 Тогда
		
		_АдресФото2 = ТаблицаФото[НачальнаяСтрока].АдресФото;
		Элементы._Фото2.Заголовок = Строка(ТаблицаФото[НачальнаяСтрока].Врач) + " (" + ТаблицаФото[НачальнаяСтрока].Врач.Специализация + ")";
		Элементы._Фото2.Видимость = Истина;
	
	КонецЕсли; 

КонецФункции // ()
 
&НаКлиенте
Процедура ФотоНажатие(Элемент, СтандартнаяОбработка)
	
	ф = 1;
	
КонецПроцедуры

Функция ТекстЗапросаВрачей()

	Возврат
	"ВЫБРАТЬ
	|	Врачи.Ссылка КАК Ссылка,
	|	Врачи.Специализация КАК Специализация,
	|	Врачи.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Врачи КАК Врачи";
	

КонецФункции // ()

&НаКлиенте
Процедура Вперед(Команда)
	
	Если ТаблицаФото.Количество() > НачальнаяСтрока + 1 Тогда
		
		НачальнаяСтрока = НачальнаяСтрока + 2;
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	Если НачальнаяСтрока > 2 Тогда
	
		НачальнаяСтрока = НачальнаяСтрока - 2;
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Фото1Нажатие(Элемент, СтандартнаяОбработка)
	
	ф = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура Фото2Нажатие(Элемент, СтандартнаяОбработка)
	
	ф = 1;
	
КонецПроцедуры
